package lessonEight;

/**
 * Created by Hillel8 on 17.12.2017.
 */
public class OOP {
    //Принципы ООП :
    //1.//Инкапсуляция
    //2.Наследование
    //3.ПОлиморфизм

//    Модификаторы доступа:
//    паблик - можно достучаться с любой точк проэкта
//    прайват - дает возможность видить мтеод или переменую в рамках одного класса
//    Протектед - можем достучаться в пределах папки и в унаследовнных классах
//
//    Области видимости
//            public
//            privat
//            protected
//            default - в пределах папки видно
}
